import re
from thbud.build_csv import extract_budget_item_name


def test_extract_name_with_bullet():
    test_cases = [
        ('1. งบรายจ่ายอื่น 3,469,200 บาท', 'งบรายจ่ายอื่น'),
        ('1) งบรายจ่ายอื่น 3,469,200 บาท', 'งบรายจ่ายอื่น'),
        ('1) งบรายจ่ายอื่น - 3,469,200 บาท', 'งบรายจ่ายอื่น'),
        ('1) งบรายจ่ายอื่น 3,469,200 3,469,200 บาท', 'งบรายจ่ายอื่น'),
        ('ผลผลิต : . ข้อเสนอเชิงนโยบายเพื่อการพัฒนางานด้านสังคม 192,605,400 บาท', 'ข้อเสนอเชิงนโยบายเพื่อการพัฒนางานด้านสังคม'),
        ('(3) ค่าโทรศัพท์ 5,789,500 บาท', 'ค่าโทรศัพท์'),
        ('7.3 แผนงานยุทธศาสตร์จัดการบัญหาแรงงานต่างด้าวและการค้ามนุษย์ 105,300,300 บาท', 'แผนงานยุทธศาสตร์จัดการบัญหาแรงงานต่างด้าวและการค้ามนุษย์'),
        ('โครงการ : 7 โครงการขับเคลื่อนการดําเนินงานตามกรอบความร่วมมือระหว่างประเทศและภูมิภาค 14,362,500 บาท', 'โครงการขับเคลื่อนการดําเนินงานตามกรอบความร่วมมือระหว่างประเทศและภูมิภาค'),
        ('2.1.2.4 ค่าก่อสร้างอาคารที่พักอาศัยและสิ่งก่อสร้างประกอบ 3,638,000 บาท', 'ค่าก่อสร้างอาคารที่พักอาศัยและสิ่งก่อสร้างประกอบ'),
        ('ผลผลิต : * บริหารจัดการ�งค์การที่มีประสิทธิ�า� 68,513,600 บาท', 'บริหารจัดการ�งค์การที่มีประสิทธิ�า�'),
        ('(13) (14) ค่าใช้จ่ายในการส่งเสริมความร�้และ�ึกอาชีพ ค่าใช้จ่ายในการจัดกิจกรรม 2,095,100 782,000 บาท บาท', 'ค่าใช้จ่ายในการส่งเสริมความร�้และ�ึกอาชีพ ค่าใช้จ่ายในการจัดกิจกรรม'),
    ]

    for line, expected in test_cases:
        assert extract_budget_item_name(line) == expected

def test_extract_name_with_no_bullet():
    test_cases = [
        ('งบรายจ่ายอื่น 3,469,200 บาท', 'งบรายจ่ายอื่น'),
        ('งบรายจ่ายอื่น 3,469,200 บาท', 'งบรายจ่ายอื่น'),
        ('ผลผลิต : ข้อเสนอเชิงนโยบายเพื่อการพัฒนางานด้านสังคม 192,605,400 บาท', 'ข้อเสนอเชิงนโยบายเพื่อการพัฒนางานด้านสังคม'),
        ('ค่าโทรศัพท์ 5,789,500 บาท', 'ค่าโทรศัพท์'),
    ]

    for line, expected in test_cases:
        assert extract_budget_item_name(line) == expected

def test_extract_name_with_no_amount():
    test_cases = [
        ('1. งบรายจ่ายอื่น', 'งบรายจ่ายอื่น'),
        ('1) งบรายจ่ายอื่น', 'งบรายจ่ายอื่น'),
        ('งบรายจ่ายอื่น', 'งบรายจ่ายอื่น'),
        ('7.3 แผนงานยุทธศาสตร์จัดการบัญหาแรงงานต่างด้าวและการค้ามนุษย์', 'แผนงานยุทธศาสตร์จัดการบัญหาแรงงานต่างด้าวและการค้ามนุษย์'),
        ('โครงการ : 7 โครงการขับเคลื่อนการดําเนินงานตามกรอบความร่วมมือระหว่างประเทศและภูมิภาค', 'โครงการขับเคลื่อนการดําเนินงานตามกรอบความร่วมมือระหว่างประเทศและภูมิภาค'),
    ]

    for line, expected in test_cases:
        assert extract_budget_item_name(line) == expected

def test_extract_name_with_no_amount_and_no_bullet():
    test_cases = [
        ('งบรายจ่ายอื่น', 'งบรายจ่ายอื่น'),
    ]

    for line, expected in test_cases:
        assert extract_budget_item_name(line) == expected