import re
from thbud.build_csv import extract_budget_item_name


def test_extract_name_with_bullet_and_one_amount():
    test_cases = [
        ('1. งบรายจ่ายอื่น 3,469,200 บาท', 'งบรายจ่ายอื่น'),
        ('1) งบรายจ่ายอื่น 3,469,200 บาท', 'งบรายจ่ายอื่น'),
        ('ผลผลิต : . ข้อเสนอเชิงนโยบายเพื่อการพัฒนางานด้านสังคม 192,605,400 บาท', 'ข้อเสนอเชิงนโยบายเพื่อการพัฒนางานด้านสังคม'),
        ('(3) ค่าโทรศัพท์ 5,789,500 บาท', 'ค่าโทรศัพท์'),
        ('7.3 แผนงานยุทธศาสตร์จัดการบัญหาแรงงานต่างด้าวและการค้ามนุษย์ 105,300,300 บาท', 'แผนงานยุทธศาสตร์จัดการบัญหาแรงงานต่างด้าวและการค้ามนุษย์'),
        ('โครงการ : 7 โครงการขับเคลื่อนการดําเนินงานตามกรอบความร่วมมือระหว่างประเทศและภูมิภาค 14,362,500 บาท', 'โครงการขับเคลื่อนการดําเนินงานตามกรอบความร่วมมือระหว่างประเทศและภูมิภาค'),
        ('2.1.2.4 ค่าก่อสร้างอาคารที่พักอาศัยและสิ่งก่อสร้างประกอบ 3,638,000 บาท', 'ค่าก่อสร้างอาคารที่พักอาศัยและสิ่งก่อสร้างประกอบ'),
        ('ผลผลิต : * บริหารจัดการ�งค์การที่มีประสิทธิ�า� 68,513,600 บาท', 'บริหารจัดการ�งค์การที่มีประสิทธิ�า�'),
        ('7.2.2 ผลผลิต 2 : การกํากับดูแลขนส่งทางน้ําและพาณิชยนาวี 375,254,900 บาท', 'การกํากับดูแลขนส่งทางน้ําและพาณิชยนาวี'),
        ('7.2.3 ผลผลิตที่ 3 : ผู้สําเร็จการศึกษาด้านวิทยาศาสตร์สุขภาพ 39,022,200 บาท', 'ผู้สําเร็จการศึกษาด้านวิทยาศาสตร์สุขภาพ'),
        ('7.4.1 โครงการที่ 1 : โครงการสนับสนุนค่าใช้จ่ายในการจัดการศึกษาตั้งแต่ระดับอนุบาลจนจบการศึกษาขั้นพื้นฐาน 18,223,100 บาท', 'โครงการสนับสนุนค่าใช้จ่ายในการจัดการศึกษาตั้งแต่ระดับอนุบาลจนจบการศึกษาขั้นพื้นฐาน'),
        ('7.2.2 ผลผลิต : การอนุญาตการประกอบธุรกิจน าเที่ยว มัคคุเทศก์ผู้น าเที่ยว และการถ่ายท าภาพยนตร์ต่างประเทศในประเทศไทย 91,190,000 บาท', 'การอนุญาตการประกอบธุรกิจน าเที่ยว มัคคุเทศก์ผู้น าเที่ยว และการถ่ายท าภาพยนตร์ต่างประเทศในประเทศไทย'),
        ('ผลผลิตที่ 1 : การส่งเสริมและพัฒนาสวนสัตว์เพื่อการท่องเที่ยว', 'การส่งเสริมและพัฒนาสวนสัตว์เพื่อการท่องเที่ยว'),
        ('7.2.1 ผลผลิตที่ 1 : ผู้สําเร็จการศึกษาด้านสังคมศาสตร์ 86,438,000 บาท', 'ผู้สําเร็จการศึกษาด้านสังคมศาสตร์'),
        ('(3) ค่าจ้างบำรุงรักษาและซ่อมแซมแก้ไขระบบตรวจสอบตู้คอนเทนเนอร์สินค้าด้วยเครื่องเอกซเรย์ตาม โครงการระยะที่ 2-4 197,208,000 บาท', 'ค่าจ้างบำรุงรักษาและซ่อมแซมแก้ไขระบบตรวจสอบตู้คอนเทนเนอร์สินค้าด้วยเครื่องเอกซเรย์ตาม โครงการระยะที่ 2-4')
    ]

    for line, expected in test_cases:
        assert extract_budget_item_name(line) == expected

def test_extract_name_with_bullet_and_two_amount():
    test_cases = [
        ('7.1 แผนงานบุคลากรภาครัฐ 1,468,670,500 บาท', 'แผนงานบุคลากรภาครัฐ'),
        ('1) งบรายจ่ายอื่น - 3,469,200 บาท', 'งบรายจ่ายอื่น'),
        ('1) งบรายจ่ายอื่น 3,469,200 3,469,200 บาท', 'งบรายจ่ายอื่น'),
        ('1) ค่าใช้จ่ายดําเนินงาน 100,676,400 64,603,100 บาท', 'ค่าใช้จ่ายดําเนินงาน'),
        ('(1) ค่าเช่ารถยนต์นั่งส่วนกลาง 4 คัน 655,200 655,200 บาท', 'ค่าเช่ารถยนต์นั่งส่วนกลาง 4 คัน'),
    ]

    for line, expected in test_cases:
        assert extract_budget_item_name(line, double_amount=True) == expected

def test_extract_name_with_no_bullet():
    test_cases = [
        ('งบรายจ่ายอื่น 3,469,200 บาท', 'งบรายจ่ายอื่น'),
        ('งบรายจ่ายอื่น 3,469,200 บาท', 'งบรายจ่ายอื่น'),
        ('ผลผลิต : ข้อเสนอเชิงนโยบายเพื่อการพัฒนางานด้านสังคม 192,605,400 บาท', 'ข้อเสนอเชิงนโยบายเพื่อการพัฒนางานด้านสังคม'),
        ('ค่าโทรศัพท์ 5,789,500 บาท', 'ค่าโทรศัพท์'),
    ]

    for line, expected in test_cases:
        assert extract_budget_item_name(line) == expected

def test_extract_name_with_no_amount():
    test_cases = [
        ('1. งบรายจ่ายอื่น', 'งบรายจ่ายอื่น'),
        ('1) งบรายจ่ายอื่น', 'งบรายจ่ายอื่น'),
        ('งบรายจ่ายอื่น', 'งบรายจ่ายอื่น'),
        ('7.3 แผนงานยุทธศาสตร์จัดการบัญหาแรงงานต่างด้าวและการค้ามนุษย์', 'แผนงานยุทธศาสตร์จัดการบัญหาแรงงานต่างด้าวและการค้ามนุษย์'),
        ('โครงการ : 7 โครงการขับเคลื่อนการดําเนินงานตามกรอบความร่วมมือระหว่างประเทศและภูมิภาค', 'โครงการขับเคลื่อนการดําเนินงานตามกรอบความร่วมมือระหว่างประเทศและภูมิภาค'),
    ]

    for line, expected in test_cases:
        assert extract_budget_item_name(line) == expected

def test_extract_name_with_no_amount_and_no_bullet():
    test_cases = [
        ('งบรายจ่ายอื่น', 'งบรายจ่ายอื่น'),
    ]

    for line, expected in test_cases:
        assert extract_budget_item_name(line) == expected